content/docs/why-take-this-course.md
+++
title = "Why Take This Course?"
author = ["Mattox Beckman"]
draft = false
weight = 1
date = 2022-08-22
publishdate = 2022-07-01
+++

Welcome to Competitive Programming!  In this class you will learn how to compete in programming contests such as ICPC,
Code Forces, and Hacker Rank.  **Is this class for you?  Read on to find out...**


## What Are the Benefits of Competitive Programming? {#what-are-the-benefits-of-competitive-programming}

Participating in coding contests has benefits!

You will

-   build confidence in your coding skills,
-   increase your coding speed,
-   be ready to crush a coding interview,
-   and quite possibly make some friends!


## But... I'm not very competitive, and besides, I'll never beat those top students! {#but-dot-dot-dot-i-m-not-very-competitive-and-besides-i-ll-never-beat-those-top-students}

That doesn't matter!  Whether you are just starting out or whether you are competing for a chance at the World Finals,
the only person you're really trying to beat is yourself.  The goal is to try hard, do a little bit better than last time,
or perhaps learn something that will help you next time.  You can do practice problems on your own, but there's nothing
like a contest to keep you honest.


## Am I ready for this course? {#am-i-ready-for-this-course}

The only prerequisite is that we assume you know how to program.  We don't even assume you're any good at it... this course
will help with that part.  But if you have programmed in Python, C, or C++ then you are ready for this course.

It does help if you've taken data structures and a theory course... but you can get started now and take those later as you
get stronger.
